app/controllers/api/products_controller.rb

SELECT "products".* FROM "products"
---
  def index
    @products = Product.all.includes(:seller, image_attachment: :blob)