app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "ArIlEwtgyxKP+N5qFnV81A=="], ["LIMIT", 1]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "bldTB19G/jtgw9m1ON5t6w=="], ["updated_at", "2021-04-09 20:55:56.721657"], ["id", 1]]
---
  def reset_session_token!
    self.session_token = SecureRandom.base64
    while (User.find_by(session_token: self.session_token))
      self.session_token = SecureRandom.base64
    end
    self.save!